#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Tue Oct 24 15:34:04 2023

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "E:/PangoPro/tinyriscv/tinyriscv.fdc"
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
report_power 
gen_netlist 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
pnr 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
remove_design -force -verilog "E:/PangoPro/tinyriscv/source/debug/jtag_top.v"
remove_design -force -verilog "E:/PangoPro/tinyriscv/source/debug/jtag_dm.v"
remove_design -verilog "E:/PangoPro/tinyriscv/source/debug/jtag_driver.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design E:/PangoPro/tinyriscv/ipcore/pll/pll.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module tinyriscv_soc_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
